num1 = float(input("Введіть перше число: "))
num2 = float(input("Введіть друге число: "))
num3 = float(input("Введіть третє число: "))
suma = num1 + num2 + num3
product = num1 * num2 * num3
print(f"Сума введених чисел: {suma}")
print(f"Добуток введених чисел: {product}")
#---------------------------------------------


zarplata = float(input("Введіть зарплату за місяць: "))
kredit = float(input("Введіть суму місячного платежу за кредит: "))
komunalki = float(input("Введіть заборгованість за комунальні послуги: "))
zalyshok = zarplata - kredit - komunalki
print(f"Залишок після виплат: {zalyshok}")
#-------------------------------------------------------------------------------


d1 = float(input("Введіть довжину першої діагоналі ромба: "))
d2 = float(input("Введіть довжину другої діагоналі ромба: "))
area = (d1 * d2) / 2
print(f"Площа ромба з діагоналями {d1} і {d2} дорівнює {area}")
#-----------------------------------------------------------------





